Revit 2018 API
Rebar.GetDistributionPath Method
 The distribution path of a rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().GetDistributionPath() instead.")]
public Line GetDistributionPath()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().GetDistributionPath() instead.")> _
Public Function GetDistributionPath As Line
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2018 and will be removed in a future version. Use GetShapeDrivenAccessor().GetDistributionPath() instead.")]
public:
Line^ GetDistributionPath()
Return Value
 A line beginning at (0, 0, 0) and representing the direction and length of the set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace